Delphisix/nrf52_cycling_power_sdk14/source/main.c
//  NRF_LOG_INFO("APP_SHUTDOWN Handler\n");
//
//  switch (event)
//  {
//    case NRF_PWR_MGMT_EVT_PREPARE_SYSOFF:
//      NRF_LOG_INFO("NRF_PWR_MGMT_EVT_PREPARE_SYSOFF\n");
////      if(sysGetState() != SYS_SLEEP){
////        goSleep();
////      }
//      break;
//
//    case NRF_PWR_MGMT_EVT_PREPARE_WAKEUP:
//      NRF_LOG_INFO("NRF_PWR_MGMT_EVT_PREPARE_WAKEUP\n");
//      UNUSED_VARIABLE(err_code);
////      if(sysGetState() == SYS_GO_WKUP){
////        peripheral_start();
////      }
//      break;
//
//    case NRF_PWR_MGMT_EVT_PREPARE_DFU:
//      NRF_LOG_INFO("NRF_PWR_MGMT_EVT_PREPARE_WAKEUP\n");
//      NRF_LOG_ERROR("Entering DFU is not supported by this example.\r\n");
//      APP_ERROR_HANDLER(NRF_ERROR_API_NOT_IMPLEMENTED);
//      break;
//  }

  return true;
}
NRF_PWR_MGMT_HANDLER_REGISTER(app_shutdown_handler,0);

/** @snippet [ANT BPWR simulator call] */

uint32_t		m_flag_measure = 0;
static void inertial_timeout_handler(void * p_context)
{
  
}

void handler_report_evt(bool act,uint16_t interval)
{
  NRF_LOG_INFO("Report interval:%d, ticks=",interval,APP_TIMER_TICKS(interval));
  uint32_t err_code;
  if(act){
//    ad7124_cmd_config();    
//    ad7124cmd_startConversion();
//    bmi160_cms_startConv();    
    if(interval >= 5){
      err_code = app_timer_start(m_report_timer_id,APP_TIMER_TICKS(interval),NULL);
    }
    else
      err_code = app_timer_start(m_report_timer_id,APP_TIMER_TICKS(50),NULL);
    APP_ERROR_CHECK(err_code);
  }
  else{
//    ad7124cmd_goStop();
//    bmi160_cmd_stop();
    err_code = app_timer_stop(m_report_timer_id);
    APP_ERROR_CHECK(err_code);
  }
}

void report_timeout_handler(void *p_context)
{
  //NRF_LOG_INFO(__func__);
  uint8_t buf[20];
  memcpy(&buf[0],adc_buffer,8);
  memcpy(&buf[8],bmi_buffer,12);
  app_ble_nus_feed_data(buf,20);
}
//void report_timeout_handler(void *p_context)
//{
//  //NRF_LOG_INFO(__func__);
//  uint8_t buf[20];
//  memcpy(&buf[0],&appParam.pitch,4);
//  memcpy(&buf[4],&appParam.pitch_prev,4);
//  memcpy(&buf[8],&appParam.torque_nm[0],4);
//  app_ble_nus_feed_data(buf,12);
//}
static void measure_timeout_handler(void * p_context)
{
  UNUSED_PARAMETER(p_context);
  uint8_t u8;
  m_flag_measure = 1;
  sysstate_t state = sysGetState();
  switch(state){
  case SYS_IDLE:
  case SYS_NORMAL:
    break;
  case SYS_GO_SLEEP:
    goSleep();
    NRF_LOG_INFO("Go Sleep\r\n");
    break;
  case SYS_SLEEP:
    // shut down system, wakeup by gpiote
    
    if(!appTimerStopped){
      app_timer_stop_all();
      appTimerStopped = true;
    }
    break;
  case SYS_GO_WKUP:
    NRF_LOG_INFO("Go Wakeup\r\n");
    peripheral_start();

    break;
    
  }
  NRF_LOG_FLUSH();

}

/**@brief Function for handling advertising events.
 *
 * @details This function will be called for advertising events which are passed to the application.
 *
 * @param[in] ble_adv_evt  Advertising event.
 */
static void on_adv_evt(ble_adv_evt_t ble_adv_evt)
{
  NRF_LOG_INFO("FUNC:%s, code:%d",__func__,ble_adv_evt);
    uint32_t err_code;

    switch (ble_adv_evt)
    {
        case BLE_ADV_EVT_FAST:
          
//            err_code = bsp_indication_set(BSP_INDICATE_ADVERTISING);
//            APP_ERROR_CHECK(err_code);
            break;
        case BLE_ADV_EVT_IDLE:
          if(m_conn_handle == BLE_CONN_HANDLE_INVALID){
            appParam.state = ST_IDLE;
            NRF_LOG_INFO("BLE ADV IDLE");
          }
          //advertising_reconfig();
            //advertising_start(false);
            //sleep_mode_enter();
            break;
        default:
            break;
    }
}

/*********  main code section ********************/
static void advertising_reconfig()
{
  for(uint8_t i=0;i<m_advertising.advdata.p_manuf_specific_data->data.size;i++){
    m_advertising.advdata.p_manuf_specific_data->data.p_data[i]++;
  }
  //sd_ble_gap_adv_data_set
  advertising_start(false);
}

/**@brief Function for initializing the Advertising functionality.
 */
static void advertising_init(void)
{
    uint32_t               err_code;
    ble_advertising_init_t init;

    memset(&init, 0, sizeof(init));
    
    ble_advdata_manuf_data_t    m_data;
    uint8_t data[] = "Hello, Grididea";
    m_data.company_identifier = 0x5329;
    m_data.data.p_data = data;
    m_data.data.size = sizeof(data);
    
    //init.advdata.p_manuf_specific_data = &m_data;

    init.advdata.name_type          = BLE_ADVDATA_FULL_NAME;
    init.advdata.include_appearance = false;
//    init.advdata.flags              = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE;
    init.advdata.flags              = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE;

    init.srdata.uuids_complete.uuid_cnt = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
    init.srdata.uuids_complete.p_uuids  = m_adv_uuids;

    init.config.ble_adv_fast_enabled  = true;
    init.config.ble_adv_fast_interval = APP_ADV_INTERVAL;
    init.config.ble_adv_fast_timeout  = APP_ADV_TIMEOUT_IN_SECONDS;

    init.evt_handler = on_adv_evt;
    
    //init.config.ble_adv_on_disconnect_disabled = true;

    err_code = ble_advertising_init(&m_advertising, &init);
    APP_ERROR_CHECK(err_code);

    ble_advertising_conn_cfg_tag_set(&m_advertising, APP_BLE_CONN_CFG_TAG);
}


/**@brief Function for the Timer initialization.
 *
 * @details Initializes the timer module. This creates and starts application timers.
 */
static void timers_init(void)
{

    // Initialize timer module.
    uint32_t err_code = app_timer_init();
    APP_ERROR_CHECK(err_code);

    // Create timers.
    err_code = app_timer_create(&m_inertial_timer_id,
                            APP_TIMER_MODE_REPEATED,
                            inertial_timeout_handler);
    APP_ERROR_CHECK(err_code);

    err_code = app_timer_create(&m_report_timer_id,
                                APP_TIMER_MODE_REPEATED,
                                report_timeout_handler);
    APP_ERROR_CHECK(err_code);    
    
}

/**@brief Function for the GAP initialization.
 *
 * @details This function will set up all the necessary GAP (Generic Access Profile) parameters of
 *          the device. It also sets the permissions and appearance.
 */
static void gap_params_init(void)
{
    uint32_t                err_code;
    ble_gap_conn_params_t   gap_conn_params;
    ble_gap_conn_sec_mode_t sec_mode;

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

    err_code = sd_ble_gap_device_name_set(&sec_mode,
                                          (const uint8_t *) DEVICE_NAME,
                                          strlen(DEVICE_NAME));
//                                          (const uint8_t *) moduleParam.appName,
//                                          strlen(moduleParam.appName));
    APP_ERROR_CHECK(err_code);

    memset(&gap_conn_params, 0, sizeof(gap_conn_params));

    gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
    gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
    gap_conn_params.slave_latency     = SLAVE_LATENCY;
    gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

    err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for initializing services that will be used by the application.
 */
static void services_init(void)
{
    uint32_t       err_code;

