Delphisix/nrf52_cycling_power_sdk14/source/main.c
/**@brief Function for initializing the GATT library. */
void gatt_init(void)
{
    ret_code_t err_code;

    err_code = nrf_ble_gatt_init(&m_gatt, gatt_evt_handler);
    APP_ERROR_CHECK(err_code);

    err_code = nrf_ble_gatt_att_mtu_periph_set(&m_gatt, BIN_PKT_SZ+3);
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for handling events from the BSP module.
 *
 * @param[in]   event   Event generated by button press.
 */
void bsp_event_handler(bsp_event_t event)
{
    uint32_t err_code;
    switch (event)
    {
        case BSP_EVENT_SLEEP:
            sleep_mode_enter();
            break;

        case BSP_EVENT_DISCONNECT:
            err_code = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            if (err_code != NRF_ERROR_INVALID_STATE)
            {
                APP_ERROR_CHECK(err_code);
            }
            break;

        case BSP_EVENT_WHITELIST_OFF:
            if (m_conn_handle == BLE_CONN_HANDLE_INVALID)
            {
                err_code = ble_advertising_restart_without_whitelist(&m_advertising);
                if (err_code != NRF_ERROR_INVALID_STATE)
                {
                    APP_ERROR_CHECK(err_code);
                }
            }
            break;

        default:
            break;
    }
}

/**
 * @brief Function for setup all thinks not directly associated with ANT stack/protocol.
 * @desc Initialization of: @n
 *         - app_tarce for debug.
 *         - app_timer, pre-setup for bsp.
 *         - bsp for signaling LEDs and user buttons.
 */
static void utils_setup(void)
{
  ret_code_t err_code;
  
  err_code = nrf_drv_gpiote_init();
  APP_ERROR_CHECK(err_code);
    // Initialize and start a single continuous mode timer, which is used to update the event time
    // on the main data page.
    err_code = app_timer_init();
    APP_ERROR_CHECK(err_code);


    err_code = nrf_pwr_mgmt_init();
    APP_ERROR_CHECK(err_code);

    err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);
    NRF_LOG_DEFAULT_BACKENDS_INIT();
    
    
    ble_stack_init();
    gap_params_init();
    gatt_init();

    
    
}

static void hal_init(void)
{
  ret_code_t err_code;
  
  err_code = nrf_drv_gpiote_init();
  APP_ERROR_CHECK(err_code);
  
  bsp_board_leds_init();
}

static void sys_evt_dispatch(uint32_t sys_evt)
{
//  fs_sys_event_handler(sys_evt);
  ant_boot_settings_event(sys_evt);
}

static uint32_t sd_evt_handler(void)
{
  uint32_t ulEvent;
  while(sd_evt_get(&ulEvent) != NRF_ERROR_NOT_FOUND){
    ant_boot_settings_event(ulEvent);
  }
  
  return 0;
}







//==============================================================

//static void fs_evt_handler(fs_evt_t const * const evt, fs_ret_t result)
//{
//    if (result != FS_SUCCESS)
//    {
//        // An error occurred.
//    }
//}


static volatile uint8_t writeflag = 0;
volatile uint8_t fdReady = 0;

static void fds_evt_handler(fds_evt_t const * const p_fds_evt)
{
  switch(p_fds_evt->id){
  case FDS_EVT_INIT:
    if(p_fds_evt->result == FDS_SUCCESS)
      fdReady = 1;
    else
      fdReady = 0;
    break;
  case FDS_EVT_WRITE:
    writeflag = 1;
    break;
  case FDS_EVT_UPDATE:
    if(p_fds_evt->result == FDS_SUCCESS)
    {
      fdReady = 1;
    }
    break;
  default:
    break;
  }
}
/**@brief Function for initializing buttons and leds.
 *
 * @param[out] p_erase_bonds  Will be true if the clear bonding button was pressed to wake the application up.
 */
//static void buttons_leds_init(bool * p_erase_bonds)
//{
//    uint32_t err_code;
//    bsp_event_t startup_event;
//
//    err_code = bsp_init(BSP_INIT_LED | BSP_INIT_BUTTONS, bsp_event_handler);
//    APP_ERROR_CHECK(err_code);
//
//    err_code = bsp_btn_ble_init(NULL, &startup_event);
//    APP_ERROR_CHECK(err_code);
//
//    *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
//}

/**@brief Function to execute while waiting for the wait burst busy flag
*/
static void event_burst_wait_handle(void)
{
    // No implementation needed
}

static void power_manage(void)
{
    uint32_t err_code = sd_app_evt_wait();
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for the Power manager.
 */
static void log_init(void)
{
    uint32_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_DEFAULT_BACKENDS_INIT();
}
static void power_management_init(void)
{
    uint32_t err_code = nrf_pwr_mgmt_init();
    APP_ERROR_CHECK(err_code);
}
/** @brief Clear bonding information from persistent storage.
 */
static void delete_bonds(void)
{
    ret_code_t err_code;

    NRF_LOG_INFO("Erase bonds!");

    err_code = pm_peers_delete();
    APP_ERROR_CHECK(err_code);
}
/**@brief Function for starting advertising.
 */
static void advertising_start(bool erase_bonds)
{
  NRF_LOG_INFO(__func__);
    if (erase_bonds == true)
    {
        delete_bonds();
        // Advertising is started by PM_EVT_PEERS_DELETE_SUCCEEDED event.
    }
    else
    {
        uint32_t err_code = ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);
        APP_ERROR_CHECK(err_code);

        NRF_LOG_DEBUG("advertising is started");
    }
}
uint16_t adc_cntr = 0;
void adc_drdy(void)
{
  adc_cntr++;
  sensorDataFeedADC(0,adc_buffer[0]>>8);
}

void bmi_drdy(void)
{
  //NRF_LOG_INFO("BMI Interrupt");
  if(appParam.state == ST_IDLE){
    //NRF_LOG_INFO("Start adv");
//    advertising_start(false);
  }
  //todo: feed IMU data to filter and fusion
  sensorDataFeedIMU(bmi_buffer);
}

#define USE_SD   0
uint32_t loopCount = 0;
uint32_t hclk_run;
//static EventQueue eventQueue(16*32);
#define FPU_EXCEPTION_MASK 0x0000009F 
/**@brief Function for application main entry, does not return.
 */
int main(void)
{
  log_init();
  hal_init();
  timers_init();
  power_management_init();
  ble_stack_init();
  gap_params_init();
  gatt_init();
  services_init();
  advertising_init();
  conn_params_init();
  
  sys_param_init();

  //app_adc_init();
  //peer_manage_init();
  bmi160_cmd_init(bmi_drdy,bmi_buffer);
  ad7124cmd_init(adc_drdy, adc_buffer);
  uint16_t rate = 25*(1 << (moduleParam.imu_rate_code-0x6));
  sensorDataInit(rate);
  appParam.adc_ptr = adc_buffer;
  appParam.bmi_ptr = bmi_buffer;

  ant_bpwr_init();
  
  

  NRF_LOG_INFO("Application started\n");
  ad7124cmd_startConversion();
  bmi160_cms_startConv();

//  bmi160_cmd_start_anymotion();
  application_timers_start();
  advertising_start(false);
  appParam.state = ST_ADVING;
  //app_adc_start();
  //ant_bpwr_start();
    for (;;)
    {
      if(NRF_LOG_PROCESS() == false){
        nrf_pwr_mgmt_run();
        //power_manage();
      }
    } 
  
}


/**
 *@}
 **/
